In [1]:
import pandas as pd
df = pd.read_csv("titanic/train.csv")
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [2]:
# Общие данные по Fare 
df['Fare'].agg(["count", "mean", "min", "max"])

count    891.000000
mean      32.204208
min        0.000000
max      512.329200
Name: Fare, dtype: float64

In [3]:
# Исключить данные где fare равен 0. Члены экипажа?
non_zero_fare = df.query('Fare != 0')
non_zero_fare_statistics = non_zero_fare['Fare'].agg(["count", "mean", "min", "max"])
non_zero_fare_statistics

count    876.00000
mean      32.75565
min        4.01250
max      512.32920
Name: Fare, dtype: float64

In [4]:
# По полу - мужчины
non_zero_fare['Fare'][df.Sex == "male"].agg(["count", "mean", "min", "max"])

count    562.000000
mean      26.205136
min        4.012500
max      512.329200
Name: Fare, dtype: float64

In [5]:
# По полу - женщины
non_zero_fare['Fare'][df.Sex == "female"].agg(["count", "mean", "min", "max"])

count    314.000000
mean      44.479818
min        6.750000
max      512.329200
Name: Fare, dtype: float64

In [6]:
# C = Cherbourg; Q = Queenstown; S = Southampton
# Стоимость билета в зависимости от порта, в котором заходили. Исключены значения, где fare = 0
df[["Fare", "Embarked"]][df.Fare > 0].groupby("Embarked").agg({"Fare" : ["count", "median", "min", "max", "mean"]})

          Fare
         count median     min       max       mean
Embarked
C          168  29.70  4.0125  512.3292  59.954144
Q           77   7.75  6.7500   90.0000  13.276030
S          629  13.00  5.0000  263.0000  27.725594

Добавление своей группировки Утверждение - люди с более высокой стоимостью билета имели более высокий шанс выжить
Предпосылки - палубы распологаются выше и ближе к шлюпкам, меньше людей на этаже, возможно лучшее отношение

In [7]:
df[["Fare", "Survived"]][df.Fare > 0].groupby("Survived").agg({"Fare" : ["count", "mean"]})

          Fare
         count       mean
Survived
0          535  22.696673
1          341  48.537330

С высокой вероятностью данные подтверждаются, добавим группировку по полу

In [8]:
df[["Fare", "Survived", "Sex"]][df.Fare > 0].groupby(["Sex","Survived"]).agg({"Fare" : ["count", "mean"]})

                 Fare
                count       mean
Sex    Survived
female 0           81  23.024385
       1          233  51.938573
male   0          454  22.638204
       1          108  41.199461

Данные также подтверждают данные утверждения. Данная статистика может помочь в проектировании судна
и повышении безопасности людей с более дешевыми билетами (на тех палубах, где стоимость билета ниже).